Revit 2027 API
BarTerminationsData.CrankTypeIdAtStart Property
 Identifies the crank type at the start of bar. Setting this property to a valid value, will set the HookTypeIdAtStart and EndTreatmentTypeIdAtStart to ElementId.InvalidElementId.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId CrankTypeIdAtStart { get; set; }
Public Property CrankTypeIdAtStart As ElementId
	Get
	Set
public:
property ElementId^ CrankTypeIdAtStart {
	ElementId^ get ();
	void set (ElementId^ value);
}
member CrankTypeIdAtStart : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: crankTypeIdAtStart doesn't represent a crank type.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
BarTerminationsData Class
Autodesk.Revit.DB.Structure Namespace